{
  "navigation": {
    "home": "Home",
    "about": "About",
    "skills": "Skills",
    "career": "Career",
    "contact": "Contact"
  },
  "home": {
    "title": "I'm Joren, a <b>Full-Stack Web Developer</b>,",
    "subtitle": "Loves <b>clean code</b>, <b>smooth interfaces</b>, and <b>well-oiled pipelines</b>."
  },
  "about": {
    "title": "About <b>Me</b>",
    "content": "<p>I studied <b>Applied Information Science</b> at <b>PXL University College</b> and currently work as a <b>full-stack .NET developer</b>, with a strong preference for <b>frontend development</b>. I'm always looking to grow as a developer, and I have a special interest in topics like <b>DevOps</b> and <b>software architecture</b>.</p><p>Something I truly enjoy is <b>mentoring</b>. Whether I'm supporting <b>colleagues</b> or guiding <b>interns</b>, I find it rewarding to share knowledge and help others develop their skills.</p><p>In my free time, I like <b>playing video games</b> and <b>going camping</b>. When I'm outdoors, I really enjoy <b>kayaking</b>, it's a great way to relax and enjoy nature.</p>",
    "skill1": "Passionate Developer",
    "skill2": "Creative Problem Solver",
    "skill3": "Team Collaborator",
    "skill4": "Continuous Learner"
  },
  "skills": {
    "title": "Technical Skills",
    "description": "A comprehensive overview of the technologies and tools I work with, organized by category and proficiency level.",
    "categories": {
      "frontend": "Frontend",
      "backend": "Backend",
      "cloud": "Cloud & DevOps",
      "testing": "Testing"
    },
    "technologiesCount": "technologies",
    "proficiency": {
      "beginner": "Beginner",
      "intermediate": "Intermediate",
      "advanced": "Advanced",
      "expert": "Expert"
    }
  },
  "technologies": {
    "frontend": {
      "angular": "Modern TypeScript-based web application framework for building dynamic single-page applications",
      "typescript": "Typed superset of JavaScript that adds static type definitions for better development experience",
      "html5": "Latest markup language standard for structuring and presenting content on the web",
      "css3": "Advanced styling language for designing beautiful and responsive web interfaces",
      "sass": "Powerful CSS preprocessor with nested syntax, variables, and mixins for maintainable stylesheets",
      "rxjs": "Reactive programming library using observables for handling asynchronous data streams"
    },
    "backend": {
      "dotnet": "Cross-platform framework for building modern web, cloud, and desktop applications with C#",
      "entityframework": "Object-relational mapping (ORM) framework that enables .NET developers to work with databases using objects",
      "cosmosdb": "Globally distributed, multi-model database service from Microsoft Azure with guaranteed low latency",
      "restapis": "Architectural style for designing networked applications using standard HTTP methods and stateless communication",
      "graphql": "Query language and runtime for APIs using HotChocolate, providing flexible and efficient data fetching",
      "martendb": "PostgreSQL document database and event store library for .NET applications"
    },
    "cloud": {
      "aks": "Managed Kubernetes container orchestration service in Azure for deploying and scaling containerized applications",
      "containerApps": "Serverless container platform for hosting microservices and APIs without managing infrastructure",
      "logicApps": "Workflow automation platform for integrating applications, data, and services across organizations",
      "functions": "Serverless compute service for running event-driven code without provisioning or managing servers",
      "entraId": "Comprehensive identity and access management service (formerly Azure Active Directory)",
      "devOpsPipelines": "Continuous integration and deployment automation for building, testing, and deploying applications",
      "applicationInsights": "Application performance monitoring service for detecting and diagnosing issues in live applications"
    },
    "testing": {
      "jest": "Delightful JavaScript testing framework with built-in snapshot testing and mocking capabilities",
      "cypress": "Fast and reliable end-to-end testing framework for modern web applications",
      "karma": "Test runner for JavaScript that executes tests in real browsers, primarily used with Angular",
      "nunit": "Popular unit-testing framework for all .NET languages with rich assertion library"
    }
  },
  "career": {
    "title": "<b>Career Journey</b>",
    "description": "My professional journey through education and work experience",
    "yearsExperience": "years of experience",
    "types": {
      "work": "Work Experience",
      "education": "Education",
      "project": "Projects",
      "certification": "Certifications"
    },
    "stats": {
      "yearsExperience": "Years Experience",
      "positions": "Positions",
      "education": "Education"
    },
    "education": {
      "title": "Applied Information Science",
      "institution": "PXL University College",
      "period": "September 2017 - June 2021",
      "description": "Bachelor's degree in Applied Information Science with focus on software development and information systems. Gained comprehensive knowledge in programming, database design, web development, and software engineering principles."
    },
    "project": {
      "bankingAppRestaurantBooking": {
        "title": "Expansion of existing banking PWA with restaurant booking functionality",
        "description": "Contributed to the expansion of an existing progressive web app in the banking sector by implementing a restaurant booking feature. Developed the frontend based on Adobe XD designs provided by the client, using their custom component library. Also made minor backend adjustments to ensure proper integration with the restaurant booking API."
      },
      "creditPortal": {
        "title": "Development and leadership of a consumer credit and mortgage management portal",
        "description": "Worked on a digital portal that enables end users to view and manage their mortgages and consumer credits. Contributed across the full stack, from frontend development to backend implementation and DevOps pipeline setup. Over time, grew into a technical team lead role, making architectural decisions, guiding the team, communicating with stakeholders, and ensuring smooth project execution."
      },
      "publicMunicipality": {
        "title": "Maintenance and infrastructure upgrade of a municipality-government integration platform",
        "description": "Maintained and extended an existing integration platform facilitating communication between municipalities and the Flemish government. The application transformed incoming data from municipalities into a format required by the government and supported additional non-governmental extensions. Took ownership of the CI/CD process by setting up a robust versioning and deployment system from scratch, and implemented small new features during the maintenance phase."
      },
      "mockWms": {
        "title": "Development of a mock WMS system to support ERP testing",
        "description": "Acted primarily as frontend developer while actively engaging with the client through biweekly demos and meetings. Built a lightweight CRUD application to simulate the essential functionality of a warehouse management system (WMS) for testing purposes. The mock system enabled the client to validate updates to their ERP system without needing to launch the full WMS environment each time, streamlining the development and testing process."
      },
      "cmsDashboard": {
        "title": "Frontend development for CMS replacement and data dashboard in the farming sector",
        "description": "Worked as a frontend developer on a project that involved replacing an outdated in-house CMS system with Umbraco. Additionally, developed an attractive and user-friendly dashboard presenting key data insights for a client in the farming sector."
      },
      "publicAdminPortal": {
        "title": "Full stack development of an admin portal for course management within a union",
        "description": "Worked as a full stack developer on the admin portal. The main feature I worked on was a platform for managing educational courses. With this platform, the union can store course information, register participants, record attendance, and maintain other essential data. The system uses event sourcing for data storage and GraphQL for querying. Everything runs in a Kubernetes environment."
      }
    },
    "work": {
      "title": "Full-Stack .NET Developer",
      "company": "Sopra Steria",
      "period": "July 2021 - Present",
      "description": "Working as a full-stack .NET developer, building enterprise applications and web solutions. Experienced in developing scalable web applications using modern technologies like Angular, .NET Core, and Azure cloud services."
    }
  },
  "contact": {
    "title": "Contact <b>Me</b>",
    "description": "Get in touch with me",
    "email": "Email",
    "linkedin": "LinkedIn",
    "downloadCV": "Download CV"
  }
}
