{
  "navigation": {
    "home": "Startpagina",
    "about": "Over mij",
    "skills": "Vaardigheden",
    "career": "Carrière",
    "contact": "Contact"
  },
  "home": {
    "title": "Ik ben Joren, een <b>Full-Stack Web Developer</b>,",
    "subtitle": "Houd van <b>clean code</b>, <b>vloeiende interfaces</b> en <b>soepele pipelines</b>."
  },
  "about": {
    "title": "Over <b>Mij</b>",
    "content": "<p>Ik studeerde <b>Toegepaste Informatica</b> aan de <b>Hogeschool PXL</b> en werk momenteel als <b>full-stack .NET developer</b>, met een sterke voorkeur voor <b>frontend development</b>. Ik ben steeds op zoek naar manieren om te groeien als ontwikkelaar, met een bijzondere interesse in <b>DevOps</b> en <b>softwarearchitectuur</b>.</p><p>Wat ik echt graag doe, is <b>mentoren</b>. Of het nu gaat om het ondersteunen van <b>collega's</b> of het begeleiden van <b>stagiairs</b>, ik haal veel voldoening uit het delen van kennis en het helpen ontwikkelen van anderen.</p><p>In mijn vrije tijd speel ik graag <b>videogames</b> en ga ik graag <b>kamperen</b>. Als ik in de natuur ben, vind ik <b>kajakken</b> heerlijk, het is een fijne manier om tot rust te komen en te genieten van de omgeving.</p>",
    "skill1": "Passie voor development",
    "skill2": "Creatieve probleemoplosser",
    "skill3": "Teamspeler",
    "skill4": "Leergierig"
  },
  "skills": {
    "title": "Technische Vaardigheden",
    "description": "Een uitgebreid overzicht van de technologieën en tools waarmee ik werk, georganiseerd per categorie en vaardigheidsniveau.",
    "categories": {
      "frontend": "Frontend",
      "backend": "Backend",
      "cloud": "Cloud & DevOps",
      "testing": "Testing"
    },
    "technologiesCount": "technologieën",
    "proficiency": {
      "beginner": "Beginner",
      "intermediate": "Gemiddeld",
      "advanced": "Gevorderd",
      "expert": "Expert"
    }
  },
  "technologies": {
    "frontend": {
      "angular": "Modern TypeScript-gebaseerd webapplicatie framework voor het bouwen van dynamische single-page applicaties",
      "typescript": "Getypeerde superset van JavaScript die statische type definities toevoegt voor een betere ontwikkelervaring",
      "html5": "Nieuwste markup taal standaard voor het structureren en presenteren van content op het web",
      "css3": "Geavanceerde styling taal voor het ontwerpen van prachtige en responsieve webinterfaces",
      "sass": "Krachtige CSS preprocessor met geneste syntax, variabelen en mixins voor onderhoudbare stylesheets",
      "rxjs": "Reactieve programmeerbibliotheek die observables gebruikt voor het verwerken van asynchrone datastromen"
    },
    "backend": {
      "dotnet": "Cross-platform framework voor het bouwen van moderne web-, cloud- en desktopapplicaties met C#",
      "entityframework": "Object-relationele mapping (ORM) framework waarmee .NET ontwikkelaars met databases kunnen werken via objecten",
      "cosmosdb": "Wereldwijd gedistribueerde, multi-model database service van Microsoft Azure met gegarandeerde lage latentie",
      "restapis": "Architectuurstijl voor het ontwerpen van netwerktoepassing met standaard HTTP-methoden en stateless communicatie",
      "graphql": "Query taal en runtime voor API's met HotChocolate, voor flexibele en efficiënte data ophaling",
      "martendb": "PostgreSQL document database en event store bibliotheek voor .NET applicaties"
    },
    "cloud": {
      "aks": "Beheerde Kubernetes container orkestratie service in Azure voor het deployen en schalen van gecontaineriseerde applicaties",
      "containerApps": "Serverless container platform voor het hosten van microservices en API's zonder infrastructuurbeheer",
      "logicApps": "Workflow automatiseringsplatform voor het integreren van applicaties, data en services binnen organisaties",
      "functions": "Serverless compute service voor het uitvoeren van event-driven code zonder servers te beheren",
      "entraId": "Uitgebreide identiteits- en toegangsbeheer service (voorheen Azure Active Directory)",
      "devOpsPipelines": "Continue integratie en deployment automatisering voor het bouwen, testen en deployen van applicaties",
      "applicationInsights": "Applicatie performance monitoring service voor het detecteren en diagnosticeren van problemen in live applicaties"
    },
    "testing": {
      "jest": "Prettig JavaScript test framework met ingebouwde snapshot testing en mocking mogelijkheden",
      "cypress": "Snel en betrouwbaar end-to-end test framework voor moderne webapplicaties",
      "karma": "Test runner voor JavaScript die tests uitvoert in echte browsers, voornamelijk gebruikt met Angular",
      "nunit": "Populair unit-testing framework voor alle .NET talen met rijke assertion bibliotheek"
    }
  },
  "career": {
    "title": "<b>Carrière Traject</b>",
    "description": "Mijn professionele reis door onderwijs en werkervaring",
    "yearsExperience": "jaar ervaring",
    "types": {
      "work": "Werkervaring",
      "education": "Onderwijs",
      "project": "Projecten",
      "certification": "Certificeringen"
    },
    "stats": {
      "yearsExperience": "Jaar Ervaring",
      "positions": "Posities",
      "education": "Onderwijs"
    },
    "education": {
      "title": "Toegepaste Informatica",
      "institution": "Hogeschool PXL",
      "period": "September 2017 - Juni 2021",
      "description": "Bachelor diploma in Toegepaste Informatica met focus op software ontwikkeling en informatiesystemen. Uitgebreide kennis opgedaan in programmeren, database design, web development en software engineering principes."
    },
    "project": {
      "bankingAppRestaurantBooking": {
        "title": "Uitbreiding van bestaande banking PWA met restaurant reserveringsfunctionaliteit",
        "description": "Bijgedragen aan de uitbreiding van een bestaande progressive web app in de bancaire sector door het implementeren van een restaurant reserveringsfunctie. Frontend ontwikkeld op basis van Adobe XD ontwerpen van de klant, gebruik makend van hun custom component bibliotheek. Ook kleine backend aanpassingen gedaan voor goede integratie met de restaurant reserverings-API."
      },
      "creditPortal": {
        "title": "Ontwikkeling en leiding van een consumptiekrediet en hypotheek beheerportaal",
        "description": "Gewerkt aan een digitaal portaal waarmee eindgebruikers hun hypotheken en consumptiekredieten kunnen bekijken en beheren. Bijgedragen aan de volledige stack, van frontend ontwikkeling tot backend implementatie en DevOps pipeline setup. In de loop van de tijd doorgegroeid naar een technische teamlead rol, waarbij ik architecturale beslissingen nam, het team begeleidde, communiceerde met stakeholders en zorgde voor een soepele projectuitvoering."
      },
      "publicMunicipality": {
        "title": "Onderhoud en infrastructuur upgrade van een gemeente-overheid integratieplatform",
        "description": "Onderhouden en uitgebreid van een bestaand integratieplatform dat communicatie tussen gemeenten en de Vlaamse overheid faciliteert. De applicatie transformeerde inkomende data van gemeenten naar een door de overheid vereist formaat en ondersteunde aanvullende niet-gouvernementele extensies. Eigenaarschap genomen van het CI/CD proces door een robuust versioning en deployment systeem vanaf nul op te zetten, en kleine nieuwe functies geïmplementeerd tijdens de onderhoudsfase."
      },
      "mockWms": {
        "title": "Ontwikkeling van een mock WMS systeem ter ondersteuning van ERP testing",
        "description": "Voornamelijk gewerkt als frontend developer terwijl ik actief betrokken was bij de klant door tweewekelijkse demo's en meetings. Een lichtgewicht CRUD applicatie gebouwd om de essentiële functionaliteit van een warehouse management systeem (WMS) te simuleren voor testdoeleinden. Het mock systeem stelde de klant in staat om updates aan hun ERP systeem te valideren zonder telkens de volledige WMS omgeving te hoeven opstarten, wat het ontwikkel- en testproces stroomlijnde."
      },
      "cmsDashboard": {
        "title": "Frontend ontwikkeling voor CMS vervanging en data dashboard in de landbouwsector",
        "description": "Gewerkt als frontend developer aan een project waarbij een verouderd in-house CMS systeem vervangen werd door Umbraco. Daarnaast ontwikkeld van een aantrekkelijk en gebruiksvriendelijk dashboard met belangrijke data inzichten voor een klant in de landbouwsector."
      },
      "publicAdminPortal": {
        "title": "Full stack ontwikkeling van een admin portaal voor cursusbeheer binnen een vakbond",
        "description": "Gewerkt als full stack developer aan het admin portaal. Het hoofdkenmerk waaraan ik werkte was een platform voor het beheren van educatieve cursussen. Met dit platform kan de vakbond cursusinformatie opslaan, deelnemers registreren, aanwezigheid bijhouden en andere essentiële data onderhouden. Het systeem gebruikt event sourcing voor data opslag en GraphQL voor querying. Alles draait in een Kubernetes omgeving."
      },
      "viewProjects": "Bekijk Projecten",
      "projects": "Projecten",
      "technologiesUsed": "Gebruikte Technologieën"
    },
    "work": {
      "title": "Full-Stack .NET Developer",
      "company": "Sopra Steria",
      "period": "Juli 2021 - Heden",
      "description": "Werkzaam als full-stack .NET developer, bouw van enterprise applicaties en web oplossingen. Ervaring in het ontwikkelen van schaalbare web applicaties met moderne technologieën zoals Angular, .NET Core en Azure cloud services."
    }
  },
  "contact": {
    "title": "Neem <b>contact</b> op",
    "description": "Neem contact met me op",
    "email": "E-mail",
    "linkedin": "LinkedIn",
    "downloadCV": "Download CV"
  }
}
